task/single-software-execution/cli/openfoam/task-20/init_file/dynamic_base/constant/turbulenceProperties
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
simulationType laminar;
laminar
{
    model Stokes;
}
